#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "49978908e7c4364e580dd37af83d5181" -> "26e8611f7f89df0d7852f01e82bb2f08"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "054a88b0d263dd02626a8676a8039abd" -> "4358d726622ee6111750ed78bb1fea0c"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "6bfb6bf716cf80c3dd61f104231049ee" -> "c73b767fdf1df23eadf5af074904d686"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "d625b5c257d75e28e9ab69d87fcc0f07" -> "4526676535c083d12de8f4bc515fbc2e"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "28158ecad87bcdf2071c69aa2c8e9f13" -> "f108b8a27a273c2dd0f7c84bc472cf48"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "b173331fc19bd14e36481bd110ec1222" -> "8cc2bbcb785114e34f1e7bb54de66f5a"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "1a0ecdf7b71337268ee6bd352d0965f0" -> "96b5fc46fd6e7f0767ac29db6af25ad5"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "064daf03a7d617eeb98078d5f3a219df" -> "32731d536e94d3db185ecc2c5312ac30"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "082886d91dd2164163d0206b5b9cc20b" -> "cea0affd41d425cf936175d8f7408d05"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "aa9a3c3245207c14cb5be666ce9950d3" -> "949491901a4c2015ea793e92290c266c"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "e11423f755b5190a8c875539ff3f9208" -> "dae39ecb91a60cca6843ab7f998eeaf6"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "de6d287628c8381d43ceba60d2b1ea02" -> "4bde55cf1df105f1655d84fdb487d639"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "67110c33d998a8d32578d4e44e8273cc" -> "f5e707291d2a1873c9c007a117fac881"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "740b600363ed80c46301fea92149fde0" -> "253b8d51757138656f0dc67fe90cdaa6"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "1e1aff9e42d64bf37484a2835a4a28cf" -> "fe840ff9bbc318828af560a465b5cc4f"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "77762a290f44ecf7a9bff749a0197356" -> "c0f69efb43fc62c1bada220c4876d47b"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "e0d2350b480c9f2e49d013e3ee4f3483" -> "291d916a6a5f686fcb3cbbcdb694a920"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "5e289b854b8ae4c9bc88e07d8efd895c" -> "153bcc75f01b97315e92f326d13099f5"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "acd22d8b10dc2629cff3ac0b145f85a6" -> "0f3c9e017ae057b725bc9b03ed7ffa84"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "5044f2ddf99a1f58f60b7b2e5044b07f" -> "43395cdf97c2e859cdba3f3714a8e30b"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "f399f3ec7c9f86082f221cfc51d78f02" -> "142901d4cd82d3062c7b7da1f5511ccc"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "53fb5af303c7555d37af81baa1e77719" -> "26245c45e5b1415ffaa65c221936b78e"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "dd0301ac1f7be65e2a22ccaabe2769fc" -> "7b8bac54a250c57efb99321a07d00866"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "effac2b751a22bd2d98af05073197cc1" -> "cf034d55d74f7128cf719053e223be6a"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "8ea237401d3e201996cd2934acf6689b" -> "bcbeef438eaa394b05af015fb99dfddb"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "3b76466691b2bebd8c4347d74f39a74e" -> "c67c0ca9bbe19f6195435c515b9aea02"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "f2c91ab053701a15b21056cb5def442c" -> "ed16d645dd132fa68fb619511cc085c1"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "b2ef4a8b899c4df6066fa4e10c4fe49f" -> "1186bace0d8604fa87dcf817d00a2be2"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "7658352201ffbf6afbfc6f44f0a3e83d" -> "d746d97f21e83f992766de8c99d3ca27"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "4f1e11549163dfc49ae8d403032f3458" -> "99db158fe12506fa63a3c7ba5995be27"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "e2fb7229cc789166e5832dfca4473915" -> "c8fa9cc2249246110f7c540d9b4e20ba"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "ea57270fefbc31f295de9c5f2f19478d" -> "1bbe233c99d24e0119739a187a3547ec"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "e6a546f3a64cf1b8a5663eb5423ac6ce" -> "c8399fe5b58182fbd3e80d428eb685c1"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "626de23d4632ab80b007e6dcb9bc10ab" -> "5632c51651789389bf5599bcb6bd4039"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "7f77ca41d8b24a5932853e5aa1d45c3d" -> "24b9e47cc410bc549113c21b243d5c9f"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "972a6a938dd7cbe4bf5e1b3f541c6bb9" -> "0d24682b9c6a1ee806602dc209e31891"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "cad73ba83e9a69389886f66c585d5aea" -> "c5e1e6903cfb8465e516ade40914d3e6"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "fb3b34e72d12a643733f33ae12f3444c" -> "707d4694f67d13fc0a3d622badc70591"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "63adc3dfcbbb8d80e3c5ca9cced34179" -> "ef83e8ab13eb48b1ade21317868f0c60"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "cc83de0fa4bebf831cf4a4ae467282d4" -> "422cf7509b0cfb22b70d47cf58964153"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "2d630ef4063fa3d73a18502e29850cd5" -> "0527a04adbc791e38d0abbd884e74033"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "cab697472f30fc827ca1996e3a415880" -> "c469675b63c6ef190499b10067c397b6"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "ee892eca0a622d9c865a63bd204ab307" -> "7686cd4f99a22a03cd6f800b2cb84dba"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "84902a6e09f5f1d9cf9d1dc517e8a157" -> "62687cd24084187d9e86edb2d95f0590"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "3616fb2b9669bcf3fbf461f08e48ec1f" -> "45dfd622c0d236a97aca3a09236ef08b"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "528f10818b49539a944476d01e4c54d0" -> "c24dac021a16a62b70fe195a1338c969"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "e2b3511b39a74c5c70ae19a1fda0ac34" -> "fdcbac94281321b5b274c2185fe4666f"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "I7vo+jTRb6BCbKMUiyTK+DuFs9zxgWfGrbad79hzuRE=" -> "DMNjdu0TbjvyVSIeQWqdH6/QveHiAoPxBTJOIv7Vba8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "AbjR8/5hiWNs6PVWzYVJhbNZYf2rshrMOHm/RY+jiko=" -> "57nLJLaSWFUFNuwQtZkgpCkUHn5Vzt8jf1Pn4/mVkwQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "ogbTPZS4lEQ+7wTuvf+Uvhl8Ol78+ntCbYWRXHWA7h8=" -> "eOc9z1eC28Db1St5NIuW5PVoZitEg1pqzWR9EWFR4kI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "yFf89J3AhTHCmlvZHnUj2Q8NSBr5aWUlLyoR6PkazuU=" -> "LRRoRXdw5dW0XBg+tI3s77QJC5/Kf0/InkkRdzThmeM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "3hrVyF67Vd8LktP9WXlhjATkdEPKfgRRoxBnj9MxRKk=" -> "9Os5+6B274ZqjmvzGJQPUwgzSzS5cmFnUrmr2Uq0UL4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "RDOQjHXM0AaOTBGPKwBlxgtG7SetR3P8LAmWx2D4sLA=" -> "DLhZWAZvFUVT80JOpaUNdTbYuSIyCw6rxRRgayKufTs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "F+Qb0efzVtk32umzT+X5IfcoayqGDhxxYCFL9eqYC0s=" -> "/RbkVA0/X+9TAvOO/L95TSnnWwTmQ7ZctHmHD8Ep65g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "KNMQfz0DRyjNfvO2NKsXVDfYguqnawjNK8OQB+ZH9kQ=" -> "HVWUrKPc/bBe6bMafDbIElcFn78k4veCYyrMq6GfrjQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "uebFC8Y4/K7eFFUd/zW48S2U6hYnKTVBQY6e4YtVr1M=" -> "9KpJQ3STmJfiqAPWNkWwhzvixiWLETlnIIYpv6jC0hc="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "oijQS2GWzk/Jqz9WUnfAYLAqC8H77t3TiWrvxDKXysI=" -> "iAszKrS6iJqdu/wKMKvLP9Aqn/c0zl+anTGK8yUpMTE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "zWINWU1K8P9ZcfdZ9L4kAWAGs+mkvSAPXTKx/9vwuoY=" -> "W2su3vrkc1HanU3F9ohykRgMKxLgnSomg8NxlkhTVy4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "r9embf8SeSPTLEGxbxfv9FZ2Wnxbf4T9xy3GxMpPjFs=" -> "imGM0q2jV07yVcYd0ED1bcokCOG226svJUk1rwloT/o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "0h7UqGBMOAn40vZRwrVWYvFdcilGWPaBh4+ZmX08Pls=" -> "+hunbBpz9CHOZLs0COJmAxWYfTPTCHxakHvxON0tlFw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "usxalsFxE2EJa6ZGxLXdbifnFuYDd+fBTNzxRU5EVpE=" -> "1htr8Or2TfPGbocaJhZ9h//mkUSuzk4LIrjWb+NX0Q8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "xxqKDCGNE4FS6e6YfAO73dlwKMeqaIbmrXNLc6utRYw=" -> "yunln9AdKfLdunu/jR6SVAuXoI/lFpdH3lN21sBOGrM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "8S2/G9/nCjy5xbLwvOe53gX74hfySHOuSnEJRQWfelI=" -> "anfyE9OwOJ3nQ3Bm/I0Q8YcrdZc/kjJ6ZgPDk+QIBW8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "IgLfBUXRiw6Z9snqc3rVgIAqVZbbLaiye7bvT3TVsf8=" -> "kaIiYOqX2e6lDOn/xew06Z+K6Xd00C+yDTxxMlA0uy4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "vdmF9SNMwepfX3WbpZHqfJIlKNncpi9/8aDVYZci8Ng=" -> "lafo8qXazlOtsG/eaiN/HIWQx9b53wucyrn10YxJoZg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q7ovP7QW+FZNeUOXENZEc2hlah2LMXrREwkpniwy17E=" -> "+2By7j4j8Ha+Grgm+DDXf4l3MjVyke/AzRpvqkauLr0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "/fj2hupGCYPggRAHam7fOlB8NhAgBHs3nYHb/rFThBg=" -> "z+FF7z0zHLqsNnhwnXl3/Uydb5r5Lg2ru2fVhsO2p0A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "YJEmcJtirN+DFDKmfCrdLluS2G7wADCNvC3sGtMF78Q=" -> "LnFz4qL+A3AZnrVR85/BEdGNuCUot0CagmoEAuXiUzs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "FR+4PNL1cdoahVEDbbKNYggPBPJVF+FuZ/vWiX1wXUs=" -> "kaqNG4h4SiiOu3ggwGKW+Xd4GfOy8dCBPFUfHFpAQYI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "AzcGwYTqYaYK7J1SH6IGQ3rD7FnxRsAAgcEuyRkvgI0=" -> "dlgDAHZJcofQfOVgX4FO5XYUwtdYSrtqkQ0vb3Lx1WE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "yODY9zTLRxFH9/SZG/eed8IshboWD/pK0r/Nsj4rXCw=" -> "+MTHxn3d7xVdSGbBLQn0diyP9IbqRtFdl1y7s7y3sB0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "UV8NuV5j9GE/yz2aMTwIwyWinCIBLCbRDjExUsNkx70=" -> "v6kpLHCHxau/KeeDCqPJSYInDfiL2Kcg1+ve+0hWvTg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "y2N05WJwh2zaGyxb/8JJHubRAQvCmWpny5NrKT84T54=" -> "ktvwTlJFzb5v2FVk6DBmmwnrVRYStHOcO3zNXHKRmug="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "1Hde0chkVPzhGUTdW7OIfzM77rBB4ZAjab5i2xJZuVI=" -> "HMOaw8oo/MhLwoBD0iEVM4LeDU+29fKVWGF7LSleUUk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "znH14WJuN5LSCJ+kACI+6nr0ebcIeVF9IptEn4Fxs5c=" -> "fCPPRrcNyqjqv5gitN6WAveh9bAtL/QEgGIbsI7oGKo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "E3T7H9+zyHVlc7Qo9FVzRJfLB4t0wkMM9yKeiJlgoJE=" -> "BCZsZFd6A7mHGa+/GhXBd9j/uzcmxT8DU75Mnzn0QeA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "G5NvU0N9zNfuHpRjsZcOlJME+ZKjQonL9aanGqlX8tE=" -> "P8kbplJEvbXRRb2oxLcyO4bt1a/QZYlKs/OThhlxGZI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-14T22:49:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "jhxjd6BAFCTXVZT6ChlOhyDCtLPuPcI1SIDewxFYdps=" -> "3VfMhbYO7MlXySYs6JsrMzaeDw3fgshBYE8hJYqS0vs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "Prtn8+O/GqRk7XHgXMR/YXqMv+3brI9ZZ1VU1dAweaI=" -> "Bj4k5PsB5j9cJKTM+o6YE956+JRvfVtA314otwnWXIA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "z3hTUThwvxGgCV674FEs+qKK+lbDiEjqF6rJgr1scXQ=" -> "vCLtMh3U2RGgIpEa+cwSq+vqEja6mPRxsqJr77xfBho="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "6u5B3O1/muZLul8YsXeDFRcG+9ipyWXf6x58d9GGD/0=" -> "4yV/K2y9x+UCuWb8oWZ7acdtlq6cN4KYWCnz103mk1M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "SENwF1tJx2hGshJ8+RBm/Y9qTIifxQOh/xSVrWH3dw4=" -> "10iSmbmWn6KSbipjd3pxxuni83I0nVqfeQBg6Sv4HXo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "2hQc7B8chDahO1FO82rnJGdKGjJ1UIaZYlL7cSLRgLM=" -> "69nWjAXIa+kuQpPXUkDzb76q4nu/4TGuo4shJCdxAB8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZWSJlb3s50Dr+bwlc40cWaZ59aQzDyTIHBJlNbSwe/4=" -> "9kGKKQtJM/nkOfBlNnaM5xc2cwLUCLljgL55HU1HaBc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "DcCkhnt4oLE4F2M7KeFvd/jo6+78TTQZXiyBBdooSnY=" -> "TcHHEOCIILQNCZMhZVP3s96ZeIpl31z9cO5ELKXHQyE="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "NW1heEXbJ1OI9sWpPbvW7fFz8U//l7MLJV3jE9rHmss=" -> "iQeTorhv8HqmrQDh9jt/13Qo6wCXZySzCFPzzcX1Chw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "k6YdB6//Bazrpepto6TekOmQlTjUhKA3V80xIdeOcgw=" -> "0WKII0/Ub5EHvyZCif0qXYY7DmM/U0mIfaVmTigZtik="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "CJG4oaEP4lTzztQ2ee0P0AahjjSs4MGtN3HXwRiz+Mk=" -> "9BO0wKz+S9Af6HesFYhOPZsaUGIjcz7gLM9XbeGAwYk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "BodYvOnXHO8WponQvzii7V/awIKBf9a5eMkCl738HAw=" -> "zDYPcVWCTQIo+g1vwbb7EzthIsL1DaVlcSN5gDY7BtA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "8fFHsQFtkVE3YZMVThsDIku5ISKpKe0WIDaofALWs0I=" -> "dVitd0rrTPSu1N8EG3CHvoAcaZIUT5KfWkjnlGoagMY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "g9aNvE7Xap0zWywBDE2FhCFuAueKDN8z1/RFFO9D+ro=" -> "N++0CRJ2bX5FsxrMHpS2KS5DM70jbxo01Rz7IypdL5c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "aotxLo1S+WGUpeI8AyvjmUIkV1ldjc6+Kh/fqWjSY8U=" -> "Zf4j4qtNO5R/MH5wbkRC6kr2ZTm9TAsML/9PyWB9TAI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "dh4axu8yUAmyi+QOo5meAF2PXYYYlvQciCNNSWWX9OU=" -> "yupzVvWBMS8jv6/ac4mZEMms5zkynNnucAT4IEtDtgA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-13T05:03:45Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "nkvkm6" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-13T05:03:44Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-13T05:03:42Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*